tutorials/pehills_foam/nutfoam_inputs/foam_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        mergeLevels       1;
        preconditioner  FDIC;
        smoother        GaussSeidel;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel   30;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        solver          GAMG;
        mergeLevels       1;
        preconditioner  FDIC;
        smoother        GaussSeidel;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel   30;
        tolerance       1e-09;
        relTol          0;
    }

    U
    {
       solver            GAMG;
       preconditioner    DILU;
       mergeLevels       1;
       smoother          GaussSeidel;
       agglomerator      faceAreaPair;
       nCellsInCoarsestLevel   30;
       tolerance       1e-09;
       relTol          0;
    }
    
    k
    {
       solver            GAMG;
       preconditioner    DILU;
       mergeLevels       1;
       smoother          GaussSeidel;
       agglomerator      faceAreaPair;
       nCellsInCoarsestLevel   30;
       tolerance       1e-09;
       relTol          0;
    }


    epsilon
    {
       solver            GAMG;
       preconditioner    DILU;
       mergeLevels       1;
       smoother          GaussSeidel;
       agglomerator      faceAreaPair;
       nCellsInCoarsestLevel   30;
       tolerance       1e-10;
       relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    convergence     1e-8;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p       0.3;
    U       0.7;
    k       0.7;
    epsilon 0.7;
}

// ************************************************************************* //
